Revit 2027 API
StairsPathType Properties
The StairsPathType type exposes the following members.
Properties
Name | Description
ArrowheadTypeId |  The arrow head type of the stairs path.
AssemblyInstanceId |  The id of the assembly instance to which the element belongs.
(Inherited from Element)
BoundingBox | Retrieves a box that circumscribes all geometry of the element.
(Inherited from Element)
CanBeCopied |  Determine if this ElementType can create a copy
(Inherited from ElementType)
CanBeDeleted |  Determine if this ElementType can be deleted
(Inherited from ElementType)
CanBeRenamed |  Determine if this ElementType can be renamed
(Inherited from ElementType)
Category | Retrieves a Category object that represents the category or sub category in which the element resides.
(Inherited from Element)
CreatedPhaseId |  Id of a Phase at which the Element was created.
(Inherited from Element)
DemolishedPhaseId |  Id of a Phase at which the Element was demolished.
(Inherited from Element)
DesignOption | Returns the design option to which the element belongs.
(Inherited from Element)
DistanceToCutMark |  The distance from the stairs path arrow to cut mark.
Document | Returns the Document in which the Element resides.
(Inherited from Element)
DrawForEachRun |  True if stairs paths should be drawn for each run, false if it should be drawn for the whole stairs.
EndAtRiser |  Represents whether the stairs path ends at the riser.
FamilyName |  Gets the family name of this element type.
(Inherited from ElementType)
FullStepArrow |  True if the arrow fills the full step width, false if it fills by the specified arrow size.
Geometry | Retrieves the geometric representation of the element.
(Inherited from Element)
GroupId |  The id of the group to which an element belongs.
(Inherited from Element)
Id |  A unique identifier for an Element in an Autodesk Revit project.
(Inherited from Element)
IsModifiable |  Identifies if the element is modifiable.
(Inherited from Element)
IsTransient |  Indicates whether an element is transient or permanent.
(Inherited from Element)
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from Element)
LevelId |  The id of the level associated with the element.
(Inherited from Element)
LineShapeAtCorner |  The line shape of stairs path at the corner.
Location | This property is used to find the physical location of an element within a project.
(Inherited from Element)
Name | Set the name for the ElementType.
(Inherited from ElementType)
OwnerViewId |  The id of the view that owns the element.
(Inherited from Element)
Parameter[BuiltInParameter] | Retrieves a parameter from the element given a parameter id.
(Inherited from Element)
Parameter[Definition] | Retrieves a parameter from the element based on its definition.
(Inherited from Element)
Parameter[Guid] | Retrieves a parameter from the element given a GUID for a shared parameter.
(Inherited from Element)
Parameters | Retrieves a set containing all of the parameters that are contained within the element.
(Inherited from Element)
ParametersMap | Retrieves a map containing all of the parameters that are contained within the element.
(Inherited from Element)
Pinned |  Identifies if the element has been pinned to prevent changes.
(Inherited from Element)
ShowArrowheadToCutMark |  True if the stairs path arrowhead should be shown to the cutmark, false if the arrow head is not shown.
StairsPathDirection |  The style of the stairs path.
StartExtension |  The start extension length of the stairs path.
StartFromRiser |  True if the stairs path starts from the riser, false if it starts from the tread.
StartSymbolTypeId |  The start symbol type of stairs path.
UniqueId |  A stable unique identifier for an element within the document.
(Inherited from Element)
VersionGuid |  Get the element version Guid.
(Inherited from Element)
ViewSpecific |  Identifies if the element is owned by a view.
(Inherited from Element)
WorksetId |  Get Id of the Workset which owns the element.
(Inherited from Element)
Top
See Also
Reference
StairsPathType Class
Autodesk.Revit.DB.Architecture Namespace